{
  "sections": {
    "header": {
      "title": "Accueil",
      "slogan": "Des solutions web qui évoluent avec vous.",
      "github": "https://github.com/Michael-Boethas",
      "linkedin": "https://www.linkedin.com/in/michael-boethas-8bba6764/?originalSubdomain=fr"
    },
    "about": {
      "title": "À propos",
      "about_me": "Je conçois et développe des solutions web sur mesure qui évoluent avec votre entreprise, vous assurant de rester en avance dans un monde digital en constante évolution."
    },
    "projects": {
      "title": "Projets récents",
      "kasa": {
        "name": "Kasa",
        "project_url": "https://p5-kasa-seven.vercel.app/",
        "codebase_url": "https://github.com/Michael-Boethas/p5-kasa",
        "thumbnail_url": "/images/Screenshot-Kasa.webp",
        "description": "Front-end d'une plateforme de location d'hébergements en ligne où les utilisateurs peuvent consulter des offres d'hébergements avec des descriptions détaillées, des photos et des avis. J'ai développé ce projet dans le cadre de ma formation pour m'exercer à la création d'une application web moderne en utilisant React. Le site est optimisé pour affichage sur tout type d'écran: desktop, tablette et mobile. Ce projet met en avant la maîtrise de React pour le développement d'applications web interactives, l'utilisation des hooks pour la gestion des états et des effets de bord ainsi que le développement d'un design responsive avec CSS3"
      },
      "nina_carducci": {
        "name": "Portfolio de Nina Carducci",
        "project_url": "https://michael-boethas.github.io/P4/",
        "codebase_url": "https://github.com/Michael-Boethas/p5-kasa",
        "thumbnail_url": "/images/Screenshot-Nina-Carducci.webp",
        "description": "Ce projet a consisté en l’optimisation complète du site portfolio de Nina Carducci, notamment l'amélioration des performances, de l'accessibilité et du référencement (SEO). J'ai réalisé des audits à l'aide de Lighthouse et GTMetrix pour repérer les points à améliorer, puis j'ai appliqué différentes optimisations selon les résultats obtenus."
      }
    },
    "stack": {
      "title": "Technologies",
      "main": "Je travaille principalement avec ",
      "secondary": "J'ai pu travailler avec"
    },
    "contact": "Contact"
  }
}


