{
  "metadata": {
    "title": "Mishmesh - Web developer portfolio",
    "description": "Full-stack web developer specialized in React, Next.js, TypeScript, Tailwind CSS, Node.js, Express, MongoDB, Strapi..."
  },
  "sections": {
    "header": {
      "title": "Home",
      "tagline": "Welcome to my portfolio",
      "github": "https://github.com/Michael-Boethas",
      "linkedin": "https://www.linkedin.com/in/michael-boethas-8bba6764/"
    },
    "about": {
      "title": "About me",
      "about_me": "I’m a full-stack web developer focused on building custom websites and applications that meet the specific needs of businesses. I love the process of taking an idea from concept to reality, seeing a project grow from nothing into a fully functional, engaging product. Working on both front-end design and back-end architecture, I ensure clean, responsive layouts and scalable code for efficient, secure sites that can evolve alongside your business."
    },
    "projects": {
      "title": "Recent projects",
      "kasa": {
        "name": "Kasa",
        "type": "frontend",
        "project_url": "https://p5-kasa-seven.vercel.app/",
        "codebase_url": "https://github.com/Michael-Boethas/p5-Kasa",
        "thumbnail_url": "/images/Screenshot-Kasa.webp",
        "description": "Front-end development of an online accommodation rental platform, allowing users to browse listings with detailed descriptions, photos, and reviews. This is a modern web application optimized for all screen types: desktop, tablet, and mobile. The project highlights the use of React and React Router to create interactive applications with reusable components, efficient state and side-effect management, as well as a responsive design developed with Sass.",
        "stack": ["react", "sass"]
      },
      "nina_carducci": {
        "name": "Nina Carducci",
        "type": "frontend",
        "project_url": "https://michael-boethas.github.io/P4/",
        "codebase_url": "https://github.com/Michael-Boethas/P4",
        "thumbnail_url": "/images/Screenshot-Nina-Carducci.webp",
        "description": "This project involved the comprehensive optimization of Nina Carducci's portfolio website, focusing on improving performance, accessibility, and search engine optimization (SEO). I conducted detailed audits using Lighthouse and GTMetrix to identify areas for enhancement and implemented various optimizations based on the findings. The full optimization report is available on the GitHub repository along with the optimized code",
        "stack": ["html", "javascript"]
      },
      "mvg": {
        "name": "Mon Vieux Grimoire",
        "type": "backend",
        "project_url": "https://p6-mon-vieux-grimoire-m6zc.onrender.com/api-docs",
        "codebase_url": "https://github.com/Michael-Boethas/p6-mon-vieux-grimoire",
        "thumbnail_url": "/images/Screenshot-Mon-Vieux-Grimoire.webp",
        "description": "An API for managing a book catalog and rating platform built with Node.js, Express, and MongoDB. It features user authentication, session management, CRUD functionality, and automatic calculation of average ratings. The project also includes middleware for image optimization, security enforcement, and event logging.  (Note: The deployment server may be idle, so a delay might occur before the connection is established.)",
        "stack": ["mongodb", "express"]
      },
      "cristina_portfolio": {
        "name": "Cristina Jiménez",
        "type": "fullstack",
        "project_url": "https://cristina-jimenez.netlify.app",
        "codebase_url": "https://github.com/Michael-Boethas/cristina",
        "thumbnail_url": "/images/Screenshot-Cristina-Portfolio.webp",
        "description": "Professional portfolio of Cristina Jiménez, a specialist in international marketing and communication. The project features a modern, responsive user interface built with Next.js (optimized for performance and SEO), along with a CMS (Strapi) that allows Cristina to update her portfolio content through an admin interface.",
        "stack": ["next.js", "tailwind", "typescript"]
      }
    },
    "stack": {
      "title": "Stack",
      "main": "I mainly work with",
      "secondary": "Some other technologies I use"
    },
    "contact": {
      "title": "Contact",
      "email_input_label": "Your email address",
      "text_input_label": "Your message",
      "submit_button_label": "Submit",
      "success_message": "Email sent successfully !",
      "error_message": "Failed to send email."
    },
    "footer": {
      "contact_CTA": "Get in touch",
      "message_part_1": "I'm currently based in ",
      "available": " and available for freelance work opportunities. ",
      "unavailable": ". ",
      "message_part_2": "Feel free to email me if you have any questions or would like to discuss potential projects or collaborations.",
      "training": "Trained at"
    }
  }
}
